tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"
tap "sst/tap"
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "eza"
brew "ffmpeg"
brew "gatsby-cli"
brew "gd"
brew "gemini-cli"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "gmime"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "grpcui"
brew "harfbuzz"
brew "hugo"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "just"
brew "kdoctor"
brew "keyring" # the python library. Needed for ykman.
brew "ktlint"
brew "kubo" # ipfs
brew "lerna"
brew "libarchive"
brew "libavif"
brew "libbluray"
brew "libheif"
brew "libidn2"
brew "librsvg"
brew "libusb"
brew "mas"
brew "minikube"
brew "mtr"
brew "neomutt"
brew "neovim"
brew "netpbm"
brew "node"
brew "notmuch"
brew "openapi-generator"
brew "opencode"
brew "openjdk"
brew "openocd", args: ["HEAD"]
brew "openssl@3"
brew "opentofu"
brew "pandoc"
brew "pango"
brew "pgpdump"
brew "pidcat"
brew "pipx"
brew "postgresql@14"
brew "protobuf"
brew "python@3.10"
brew "python@3.9"
brew "qsv"
brew "rav1e"
brew "ripgrep"
brew "ruby"
brew "rustup" # to install rust, run: `rustup-init`
brew "s3cmd"
brew "scrcpy"
brew "subversion" # required for fetching fonts
brew "swagger-codegen"
brew "tarsnap"
brew "teamookla/speedtest/speedtest"
brew "tesseract"
brew "tree"
brew "trufflehog"
brew "unbound"
#brew "urlwatch" # Use `pipx install urlwatch && pipx inject urlwatch jq` instead to allow use of urlwatch's jq filter
brew "watch"
brew "wget"
brew "xcode-kotlin"
brew "yarn"
brew "ykman"
cask "1password-cli"
cask "anki"
cask "balenaetcher"
cask "basictex" # for pandoc
cask "blender@lts"
cask "bruno" # API client, like Postman or Insomnia
cask "calibre"
cask "cloudcompare" #3d point cloud viewer for LIDAR data
cask "codex"
cask "cursor" # cursor.sh
cask "daisydisk" # key in email
cask "dbeaver-community" # postgres gui
cask "descript"
cask "discord"
cask "docker-desktop"
cask "duet"
cask "figma"
cask "firefox"
cask "flux-app"
cask "font-inter"
cask "font-roboto"
cask "freecad"
cask "gcc-arm-embedded"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "halloy" # irc client
cask "handbrake-app"
cask "hex-fiend"
cask "insomnia"
cask "ipfs-desktop"
cask "iterm2"
cask "jetbrains-toolbox"
cask "linear-linear"
cask "logitech-options"
cask "macdown"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "opal-composer"
cask "proxyman"
cask "raspberry-pi-imager"
cask "reflect" # Reflect Notes
cask "sizeup" # key in email
cask "sketchup"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "tidal"
cask "todoist-app"
cask "twist"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "wireshark-app"
cask "zoom"

# Mac App Store
# Search for more with `mas search [name]`
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
#mas "Speedtest by Ookla", id: 1153157709
mas "Tailscale", id: 1475387142
#mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
#mas "Whatsapp", id: 1147396723

# Notes: Other things brew can't install (manually install them)
# Davinci Resolve
# Ohmyzsh
# Readwise
# Signal
# Whatsapp

