tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "lokalise/cli-2"
tap "teamookla/speedtest"
brew "awscli"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "ffmpeg"
brew "gatsby-cli"
brew "gd"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gmime"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "grpcui"
brew "harfbuzz"
brew "hugo"
brew "imagemagick"
brew "iperf3"
brew "ipfs"
brew "jq"
brew "keyring" # the python library. Needed for ykman.
brew "lerna"
brew "libarchive"
brew "libavif"
brew "libbluray"
brew "libheif"
brew "libidn2"
brew "librsvg"
brew "libusb"
brew "lokalise/cli-2/lokalise2"
brew "mas"
brew "minikube"
brew "mtr"
brew "neomutt"
brew "netpbm"
brew "node"
brew "notmuch"
brew "openapi-generator"
brew "openjdk"
brew "openssl@3"
brew "pango"
brew "pgpdump"
brew "pidcat"
brew "protobuf"
brew "python@3.10"
brew "python@3.9"
brew "rav1e"
brew "rust"
brew "s3cmd"
brew "scrcpy"
brew "subversion" # required for fetching fonts
brew "swagger-codegen"
brew "tarsnap"
brew "teamookla/speedtest/speedtest"
brew "tesseract"
brew "tree"
brew "unbound"
brew "wget"
brew "yarn"
brew "ykman"
cask "anki"
cask "cron" # the calendar
cask "descript"
cask "discord"
cask "docker"
cask "duet"
cask "figma"
cask "firefox"
cask "flux"
cask "glance"
cask "google-chrome"
cask "handbrake"
cask "ipfs"
cask "iterm2"
cask "jetbrains-toolbox"
cask "linear-linear"
cask "macdown"
cask "obs"
cask "obsidian"
cask "proxyman"
cask "raspberry-pi-imager"
cask "shureplus-motiv"
cask "sizeup"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "tidal"
cask "todoist"
cask "twist"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zoom"

# Fonts
cask "font-inter"
cask "font-roboto"

# Mac App Store
# Search for more with `mas search [name]`
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
#mas "Speedtest by Ookla", id: 1153157709
mas "Tailscale", id: 1475387142
#mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
#mas "Whatsapp", id: 1147396723

# Notes: Other things brew can't install (manually install them)
# Davinci Resolve
# Ohmyzsh
# Opal camera
# Readwise
# Reflect.app
# Signal
# Whatsapp

